{"language": "English", "category": "Holy Sacrifice of the Mass", "title": "After Mass", "text": "*Prayer to the Blessed Virgin Mary after Holy Mass*\r\nO Mary, most holy Virgin and Mother, behold, I have received thy most beloved Son, Jesus Christ, whom thou concievedst in thy spotless womb, bore, nursed, and held with thy sweet embraces. Behold Him at whose sight thou willst rejoice and be filled with every delight. With love I humbly return Him and offer Him to thee, to hold once more, to love with all thy heart, and to offer to the Holy Trinity as our supreme act of worship for thy honor and glory and for my good and the good of all the world. Therefore I ask thee, most loving Mother, to ask God for forgiveness of all my sins, abundant graces to help me serve Him more faithfully, and for that final grace that I may praise Him with thee for ever and ever. Amen.\r\n\r\n*Prayer to St. Joseph After Mass*\r\nGuardian of virgins and father, Saint Joseph, to whose faithful custody Innocence itself, Christ Jesus, and Mary, Virgin of virgins, was committed; I pray and beseech thee by each of these dear pledges, Jesus and Mary, that, being preserved from all uncleanness, I may with spotless mind, pure heart, and a chaste body, ever serve Jesus and Mary most chastely all the days of my life. Amen.\r\n\r\n*Prayer of St. Thomas Aquinas After Mass*\r\nLord, Father all-powerful, and ever-living God, I thank Thee, for even though I am a sinner, Thy unprofitable servant, not because of my worth, but in the kindness of Thy mercy, Thou hast fed me with the precious Body and Blood of Thy Son, our Lord Jesus Christ. I pray that this holy communion may not bring me condemnation and punishment but forgiveness and salvation. May it be a helmet of faith and a shield of good will. May it purify me from evil ways and put an end to my evil passions. May it bring me charity and patience, humility and obedience, and growth in power to do good. May it be my strong defense against all my enemies, visible and invisible, and the perfect calming of all my evil impulses, bodily and spiritual. May it unite me more closely to Thee, the one true God and lead me safely through death to everlasting happiness with Thee. And I pray that Thou willest lead me, a sinner to the banquet where Thou with Thy Son and Holy Spirit, art true and perfect light, total fulfillment, everlasting joy, gladness without end, and perfect happiness to Thy saints. Grant this through Christ our Lord. Amen.\r\n\r\n*Prayer of St. Bonaventure after Holy Mass*\r\nPierce, O most Sweet Lord Jesus, my inmost soul with the most joyous and healthful wound of Thy love, with true, serene, and most holy apostolic charity, that my soul may ever languish and melt with love and longing for Thee, that it may yearn for Thee and faint for Thy courts, and long to be dissolved and to be with Thee.\r\n\r\nGrant that my soul may hunger after Thee, the bread of angels, the refreshment of holy souls, our daily and supersubstantial bread, having all sweetness and savor and every delight of taste; let my heart ever hunger after and feed upon Thee, upon whom the angels desire to look, and may my inmost soul be filled with the sweetness of Thy savor; may it ever thirst after Thee, the fountain of life, the fountain of wisdom and knowledge, the fountain of eternal light, the torrent of pleasure, the richness of the house of God.\r\n\r\nMay it ever compass Thee, seek Thee, find Thee, run to Thee, attain Thee, meditate upon Thee, speak of Thee, and do all things to the praise and glory of Thy name, with humility and discretion, with love and delight, with ease and affection, and with perseverance unto the end; may Thou alone be ever my hope, my entire assurance, my riches, my delight, my pleasure, my joy, my rest and tranquility, my peace, my sweetness, my fragrance, my sweet savor, my food, my refreshment, my refuge, my help, my wisdom, my portion, my possession and my treasure, in whom may my mind and my heart be fixed and firmly rooted immovably henceforth and for ever. Amen."}