{"language": "Latin", "category": "Holy Sacrifice of the Mass", "title": "After Mass", "text": "*O Maria, Oratio ad Mariam Virginem Post Missam*\r\nO Maria, Virgo et Mater sanctissima, ecce suscepi dilectissimum Filium tuum, quem immaculato utero tuo concepisti, genuisti, lactasti, atque suavissimis amplexibus strinxisti. Ecce, cuius aspectu laetabaris et omnibus deliciis replebaris, illum ipsum tibi humiliter et amanter repraesento et offero tuis brachiis constringendum, tuo corde amandum, sanctissimaeque Trinitati in supremum latriae cultum, pro tui ipsius honore et gloria et pro meis totiusque mundi necessitatibus, offerendum. Rogo ergo te, piissima Mater, impetra mihi veniam omnium peccatorum meorum, uberemque gratiam ipsi deinceps fidelius serviendi, ac denique gratiam finalem, ut eum tecum laudare possim per omnia saecula saeculorum. Amen.\r\n\r\n*Oratio ad Sanctum Ioseph Post Missam*\r\nVirginum custos et pater, sancte Ioseph, cuius fideli custodiae ipsa Innocentia Christus Iesus et Virgo virginum Maria commisa fuit; te per hoc utrumque carissimum pignus Iesum et Mariam obsecro et obtestor, ut me, ab omni immunditia praeservatum, mente incontaminata, puro corde et casto corpore Iesu et Mariae semper facias castissime famulari. Amen.\r\n\r\n*Oratio Sancti Thomae Aquinatis Post Missam*\r\nGratias tibi ago, Domine, sancte Pater, omnipotens aeterne Deus, qui me peccatorem, indignum famulum tuum, nullis meis meritis, sed sola dignatione misericordiae tuae satiare dignatus es pretioso Corpore et Sanguine Filii tui, Domini nostri Iesu Christi. Et precor, ut haec sancta communio non sit mihi reatus ad poenam, sed intercessio salutaris ad veniam. Sit mihi armatura fidei et scutum bonae voluntatis. Sit vitiorum meorum evacuatio, concupiscentiae et libidinis exterminatio, caritatis et patientiae, humilitatis et oboedientiae omniumque virtutum augmentatio: contra insidias inimicorum omnium, tam visibilium quam invisibilium firma defensio; motuum meorum, tam carnalium quam spiritualium, perfecta quietatio: in te uno ac vero Deo firma adhaesio; atque finis mei felix consummatio. Et precor te, ut ad illud ineffabile convivium me peccatorem perducere digneris, ubi tu, cum Filio tuo et Spiritu Sancto, Sanctis tuis es lux vera, satietas plena, gaudium sempiternum, iucunditas consummata et felicitas perfecta. Per eundem Christum Dominum nostrum. Amen.\r\n\r\n*Oratio Sancti Bonaventurae Post Missam*\r\nTransfige, dulcissime Domine Iesu, medullas et viscera animae meae suavissimo ac saluberrimo amoris tui vulnere, vera serenaque et apostolica sanctissima caritate, ut langueat et liquefiat anima mea solo semper amore et desiderio tui, te concupiscat et deficiat in atria tua, cupiat dissolvi et esse tecum.\r\n\r\nDa ut anima mea te esuriat, panem Angelorum, refectionem animarum sanctarum; panem nostrum cotidianum, supersubstantialem, habentem omnem dulcedinem et saporem, et omne delectamentum suavitatis. Te, in quem desiderant Angeli prospicere, semper esuriat et comedat cor meum, et dulcedine saporis tui repleantur viscera animae meae; te semper sitiat fontem vitae, fontem sapientiae et scientiae, fontem aeterni luminis, torrentem voluptatis, ubertatem domus Dei.\r\n\r\nTe semper ambiat, te quaerat, te inveniat, ad te tendat, ad te perveniat, te meditetur, te loquatur, et omnia operetur in laudem et gloriam nominis tui, cum humilitate et discretione, cum dilectione, et delectatione, cum facilitate et affectu, cum perseverantia usque in finem; ut tu sis solus semper spes mea, tota fiducia mea, divitiae meae, delectatio mea, iucunditas mea, gaudium meum, quies et tranquillitas mea, pax mea, suavitas mea, odor meus, dulcedo mea, cibus meus, refectio mea, refugium meum, auxilium meum, sapientia mea, portio mea, possessio mea, thesaurus meus, in quo fixa et firma et immobiliter semper sit radicata mens mea et cor meum. Amen."}