{"language": "Latin", "category": "Holy Sacrifice of the Mass", "title": "At the Foot of the Altar", "text": "**P. ✠ In nomine Patris, et Filii, et Spiritus Sancti. Amen.**\r\n**P. Introibo ad altare Dei**\r\nS. Ad Deum qui laetificat juventutem meam.\r\n\r\n*Ps. 42:1-5*\r\n**P. Judica me, Deus, et discerne causam meam de gente non sancta: ab homine iniquo et doloso erue me.**\r\nS. Quia tu es, Deus, fortitudo mea: quare me repulisti, et quare tristis incedo, dum affligit me inimicus?\r\n**P. Emitte lucem tuam et veritatem tuam: ipsa me deduxerunt et adduxerunt in montem sanctum tuum, et in tabernacula tua.**\r\nS. Et introibo ad altare Dei: ad Deum qui laetificat juventutem meam.\r\n**P. Confitebor tibi in cithara, Deus, Deus meus quare tristis es anima mea, et quare conturbas me?**\r\nS. Spera in Deo, quoniam adhuc confitebor illi: salutare vultus mei, et Deus meus.\r\n**P. Gloria Patri, et Filio, et Spiritui Sancto.**\r\nS. Sicut erat in principo, et nunc, et semper: et in saecula saeculorum. Amen.\r\n**P. Introibo ad altare Dei.**\r\nS. Ad Deum qui laetificat juventutem meam.\r\n\r\n**P. ✠ Adjutorium nostrum in nomine Domini.**\r\nS. Qui fecit coelum et terram.\r\n\r\n**P. Confiteor Deo omnipotenti, beatae Mariae semper Virgini, beato Michaeli Archangelo, beato Joanni Baptistae, sanctis Apostolis Petro et Paulo, omnibus Sanctis, et vobis Fratres: quia peccavi nimis cogitatione verbo, et opere: mea culpa, mea culpa, mea maxima culpa. Ideo precor beatam Mariam semper Virginem, beatum Michaelem Archangelum, beatum Joannem Baptistam, sanctos Apostolos Petrum et Paulum, omnes Sanctos, et vos Fratres, orare pro me ad Dominum Deum Nostrum.**\r\nS. Misereatur tui omnipotens Deus, et dimissis peccatis tuis, perducat te ad vitam aeternam.\r\n**P. Amen.**\r\n\r\nS. Confiteor Deo omnipotenti, beatae Mariae semper Virgini, beato Michaeli Archangelo, beato Joanni Baptistae, sanctis Apostolis Petro et Paulo, omnibus Sanctis, et tibi Pater: quia peccavi nimis cogitatione verbo, et opere: mea culpa, mea culpa, mea maxima culpa. Ideo precor beatam Mariam semper Virginem, beatum Michaelem Archangelum, beatum Joannem Baptistam, sanctos Apostolos Petrum et Paulum, omnes Sanctos, et te Pater, orare pro me ad Dominum Deum Nostrum.\r\n**P. Misereatur tui omnipotens Deus, et dimissis peccatis tuis, perducat te ad vitam aeternam.**\r\nS. Amen.\r\n\r\n**P. ✠ Indulgentiam absolutionem, et remissionem peccatorum nostrorum, tributat nobis omnipotens et misericors Dominus.**\r\nS. Amen.\r\n\r\n**P. Deus, tu conversus vivificabis nos.**\r\nS. Et plebs tua laetabitur in te.\r\n**P. Ostende nobis Domine, misericordiam tuam.**\r\nS. Et salutare tuum da nobis.\r\n**P. Domine, exuadi orationem meam.**\r\nS. Et clamor meus ad te veniat.\r\n**P. Dominus vobiscum.**\r\nS. Et cum spiritu tuo.\r\n**P. Oremus.**\r\n\r\n**Aufer a nobis, quaesumus Domine, iniquitates nostras: ut ad Sancta Sanctorum puris mereamur mentibus introire. Per Christum Dominum nostrum. Amen.**\r\n**Oramus te. Domine, per merita Sanctorum tuorum, quorum reliquiae hic sunt et omnium Sanctorum: ut indulgere digneris omnia peccata mea. Amen.**"}