{"language": "English", "category": "Holy Sacrifice of the Mass", "title": "At the Foot of the Altar", "text": "**P. ✠ In the Name of the Father, and of the Son, and of the Holy Ghost. Amen.**\r\n**P. I will go to the altar of God.**\r\nS. To God, the joy of my youth.\r\n\r\n*Ps. 42:1-5*\r\n**P. Do me justice, O God, and fight my fight against an unholy people, rescue me from the wicked and deceitful man.**\r\nS. For Thou, O God, art my strength, why hast Thou forsaken me? And why do I go about in sadness, while the enemy harasses me?\r\n**P. Send forth Thy light and thy truth: for they have led me and brought me to thy holy hill and Thy dwelling place.**\r\nS. And I will go to the altar of god, to God, the joy of my youth.\r\n**P. I shall yet praise Thee upon the harp, O God, my God. Why art thou sad, my soul, and why art thou downcast?**\r\nS. Trust in God, for I shall yet praise Him, my Savior, and my God.\r\n**P. Glory be to the Father, and to the Son, and to the Holy Ghost.**\r\nS. As it was in the beginning is now, and ever shall be, world without end. Amen.\r\n**P. I will go to the altar of God.**\r\nS. To God, the joy of my youth.\r\n\r\n**P. ✠ Our help is in the Name of the Lord.**\r\nS. Who made heaven and earth.\r\n\r\n**P. I confess to Almighty God, to Blessed Mary ever Virgin, to Blessed Michael the Archangel, to Blessed John the Baptist, to the Holy Apostles Peter and Paul, to all the angels and saints, and to you my brothers and sisters, that I have sinned exceedingly in thought, word, deed. (here he strikes his breast three times) through my fault, through my fault, through my most grievous fault, and I ask Blessed Mary ever Virgin, Blessed Michael the Archangel, Blessed John the Baptist, the Holy Apostles Peter and Paul, all the Angels and Saints, and you my brothers and sisters, to pray for me to the Lord our God.**\r\nS. May almighty God have mercy on you, forgive you all your sins, and bring you to everlasting life.\r\n**P. Amen.**\r\n\r\nS. I confess to Almighty God, to Blessed Mary ever Virgin, to Blessed Michael the Archangel, to Blessed John the Baptist, to the Holy Apostles Peter and Paul, to all the angels and saints, and to you father, that I have sinned exceedingly in thought, word, deed. (here one strikes one's breast three times) through my fault, through my fault, through my most grievous fault, and I ask Blessed Mary ever Virgin, Blessed Michael the Archangel, Blessed John the Baptist, the Holy Apostles Peter and Paul, all the Angels and Saints, and to you Father, to pray for me to the Lord our God.\r\n**P. May Almighty God have mercy on you, forgive you your sins, and bring you to everlasting life.**\r\nS. Amen.\r\n\r\n**P. ✠ May the Almighty and Merciful Lord grant us pardon, absolution, and remission of our sins.**\r\nS. Amen.\r\n\r\n**P. Turn to us, O God, and bring us life.**\r\nS. And Your people will rejoice in You.\r\n**P. Show us, Lord, Your mercy.**\r\nS. And grant us Your salvation.\r\n**P. O Lord, hear my prayer.**\r\nS. And let my cry come to You.\r\n**P. May the Lord be with you.**\r\nS. And with your spirit.\r\n**P. Let us pray.**\r\n\r\n**P. Take away from us our iniquities, we beseech Thee, O Lord, that we may be worthy to enter with pure minds into the Holy of Holies, through Christ our Lord. Amen.**\r\n**P. We beseech Thee, O Lord, by the merits of Thy Saints whose relics lie here, and of all the Saints: that Thou would vouchsafe to pardon me all my sins. Amen.**"}