{"language": "English", "category": "Holy Sacrifice of the Mass", "title": "Before Mass", "text": "*Prayer to Blessed Mary Before Mass*\r\nO Mother of mercy and of love, most blessed Virgin Mary, I, a poor and unworthy sinner, fly to thee with all my heart and all my affection. I implore thy loving-kindness, that even as thou didst stand beside thy dear Son as He hung upon the Cross, so wilt thou also stand by me, a poor sinner, and beside all thy faithful people receiving the most sacred Body of thy Son. Grant us, that by thy grace, we may receive Him worthily and fruitfully. Amen.\r\n\r\n*Prayer to Saint Joseph Before Mass*\r\nO blessed Joseph, happy man, to whom it was given not only to see and to hear that God Whom many kings longed to see, and saw not, to hear, and heard not; but also to carry Him in your arms, to embrace Him, to clothe Him, and guard and defend Him.\r\n\r\n℣. Pray for us, O Blessed Joseph.\r\n℟. That we may be made worthy of the promises of Christ.\r\n\r\nO God, Who has given us a royal priesthood, we beseech Thee, that as Blessed Joseph was found worthy to touch with his hands, and to bear in his arms, Thy only-begotten Son, born of the Virgin Mary, so may we be made fit, by cleanness of heart and blamelessness of life, to minister at Thy holy altar; may we, this day, with reverent devotion partake of the Sacred Body and Blood of Thy Only-begotten Son, and may we in the world to come be accounted worthy of receiving an ever-lasting reward. Through the same Christ our Lord. Amen.\r\n\r\n*Prayer to All the Angels and Saints Before Mass*\r\nAngels, Archangels, Thrones, Dominations, Principalities, Powers, heavenly Virtues, Cherubim and Seraphim; all Saints of God, holy men and women, and for you especially my patrons: deign to intercede for me that I may be worthy to offer this Sacrifice to almighty God, to the praise and glory of His name, for my own welfare and also that of all His holy Church. Amen.\r\n\r\n*Prayer of St. Thomas Aquinas Before Mass*\r\nAlmighty and ever-lasting God, I approach the sacrament of Thy only-begotten Son, our Lord Jesus Christ.\r\n\r\nI come sick to the doctor of life, unclean to the fountain of mercy, blind to the radiance of eternal light, and poor and needy to the Lord of heaven and earth.\r\nTherefore, I implore Thee in Thy great generosity, to heal my sickness, to wash away my defilement, enlighten my blindness, to enrich my poverty, and to clothe my nakedness, so that I may receive the bread of angels, the King of kings, and the Lord of lords with reverence and humility, with contrition and devotion, with purity and faith, and with such purpose and determination that will be expedient to the salvation of my soul.\r\n\r\nGrant me, I beseech Thee, that I may not only receive the Sacrament of the Body and Blood of the Lord, but also the reality and power of the Sacrament.\r\nO most kind God, grant that I may receive the Body of Thine only-begotten Son, our Lord Jesus Christ, born of the Virgin Mary, and so received that I may be worthy to be incorporated into His mystical body, and numbered among His members.\r\n\r\nO most loving Father, grant me Thy beloved Son, which I now receive under the veil of a sacrament, that I may one day behold Him face to face in glory, Who lives and reigns with Thee in the unity of the Holy Spirit, God, forever. Amen.\r\n\r\n*Prayer Before Mass by St Ambrose*\r\nLord Jesus Christ, I approach Thy banquet table in fear and trembling, for I am a sinner, and dare not rely on my own worth, but only on Thy goodness and mercy. I am defiled by my many sins in body and soul, and by my unguarded thoughts and words. Gracious God of majesty and awe, I seek Thy protection, I look for Thy healing. Poor troubled sinner that I am, I appeal to Thee, the fountain of all mercy. I cannot bear Thy judgment, but I trust in Thy salvation. Lord, I show my wounds to Thee and uncover my shame before Thee. I know my sins are many and great, and they fill me with fear, but I hope in Thy mercies, for they cannot be numbered.\r\n\r\nLord Jesus Christ, Eternal King, God and man, crucified for mankind, look upon me with mercy and hear my prayer, for I trust in Thee. Have mercy on me, full of sorrow and sin, for the depth of Thy compassion never ends.\r\n\r\nPraise to Thee saving sacrifice, offered on the wood of the cross for me and for all mankind. Praise to the noble and precious Blood, flowing from the wounds of my crucified Lord Jesus Christ and washing away the sins of the whole world.\r\n\r\nRemember, Lord, Thy creature, whom Thou hast redeemed with Thy blood; I repent my sins, and I long to put right what I have done. Merciful Father, take away all my offenses and sins; purify me in body and soul, and make me worthy to taste the Holy of Holies. May Thy Body and Blood, which I intend to receive, although I am unworthy, be for me the remission of my sins, the washing away of my guilt, the end of my evil thoughts, and the rebirth of my better instincts. May it incite me to do the works pleasing to Thee, and a firm defense of body and soul against the wiles of my enemies. Amen."}