{"language": "Latin", "category": "Holy Sacrifice of the Mass", "title": "Before Mass", "text": "*Oratio ad Beatam Mariam Virginem Ante Missam*\r\nO Mater pietatis et misericordiae, beatissima Virgo Maria, ego miser et indignus peccator ad te confugio toto corde et affectu; et precor pietatem tuam, ut, sicut dulcissimo Filio tuo in Cruce pendenti astitisti, ita et mihi, misero peccatori, et fidelibus omnibus sacrosanctum Filii tui Corporis sumentibus, clementer adsistere digneris, ut, tua gratia adiuti, digne ac fructuose Illud sumere valeamus. Amen.\r\n\r\n*Oratio ad Sanctum Ioseph Ante Missam*\r\nO felicem virum, beatum Ioseph, cui datum est Deum, quem multi reges voluerunt videre et non viderunt, audire et non audierunt, non solum videre et audire, sed portare, deosculari, vestire et custodire!\r\n\r\n℣. Ora pro nobis, beate Ioseph.\r\n℟. Ut digni efficiamur promissionibus Christi.\r\n\r\nDeus, qui dedisti nobis regale sacerdotium: praesta, quaesumus; ut, sicut beatus Ioseph unigenitum Filium tuum, natum ex Maria Virgine, suis manibus reverenter tractare meruit et portare, ita nos facias cum cordis munditia et operis innocentia tuis sanctis altaribus deservire, ut sacrosanctum Filii tui Corpus et Sanguinem hodie digne sumamus, et in futuro saeculo praemium habere mereamur aeternum. Per eundem Christum Dominum nostrum. Amen.\r\n\r\n*Oratio Ad Omnes Angelos et Sanctos Ante Missam*\r\nAngeli, Archangeli, Throni, Dominationes, Principatus, Potestates, Virtutes caelorum, Cherubim atque Seraphim, omnes Sancti et Sanctae Dei, praesertim Patroni mei, intercedere dignemini pro me, ut hoc sacrificium Deo omnipotenti digne valeam offerre, ad laudem et gloriam nominis sui et ad utilitatem meam totiusque Ecclesiae suae sanctae. Amen.\r\n\r\n*Oratio Sancti Thomae Aquinatis Ante Missam*\r\nOmnipotens sempiterne Deus, ecce accedo ad sacramentum unigeniti Filii tui, Domini nostri, Iesu Christi; accedo tamquam infirmus ad medicum vitae, immundus ad fontem misericordiae, caecus ad lumen claritatis aeternae, pauper et egenus ad Dominum caeli et terrae.\r\n\r\nRogo ergo immensae largitatis tuae abundantiam, quatenus meam curare digneris infirmitatem, lavare foeditatem, illuminare caecitatem, ditare paupertatem, vestire nuditatem; ut panem Angelorum, Regem regum et Dominum dominantium, tanta suscipiam reverentia et humilitate, tanta contritione et devotione, tanta puritate et fide, tali proposito et intentione, sicut expedit saluti animae meae.\r\n\r\nDa mihi, quaeso, Dominici Corporis et Sanguinis non solum suscipere sacramentum, sed etiam rem et virtutem sacramenti.\r\n\r\nO mitissime Deus, da mihi Corpus unigeniti Filii tui, Domini nostri, Iesu Christi, quod traxit de Virgine Maria, sic suscipere, ut corpori suo mystico merear incorporari, et inter eius membra connumerari.\r\n\r\nO amantissime Pater, concede mihi dilectum Filium tuum, quem nunc velatum in via suscipere propono, revelata tandem facie perpetuo contemplari: Qui tecum vivit et regnat in unitate Spiritus Sancti, Deus, per omnia saecula saeculorum. Amen.\r\n\r\n*Oratio Sancti Ambrosii Ante Missam*\r\nAd mensam dulcissimi convivii tui, pie Domine Iesu Christe, ego peccator de propriis meis meritis nihil praesumens, sed de tua confidens misericordia et bonitate, accedere vereor et contremisco. Nam cor et corpus habeo multis criminibus maculatum, mentem et linguam non caute custoditam. Ergo, o pia Deitas, o tremenda maiestas, ego miser, inter angustias deprehensus, ad te fontem misericordiae recurro, ad te festino sanandus, sub tuam protectionem fugio; et quem Iudicem sustinere nequeo, Salvatorem habere suspiro. Tibi, Domine, plagas meas ostendo, tibi verecundiam meam detego. Scio peccata mea multa et magna, pro quibus timeo; spero in misericordias tuas, quarum non est numerus.\r\n\r\nRespice ergo in me oculis misericordiae tuae, Domine, Iesu Christe, Rex aeterne, Deus et homo, crucifixus propter hominem. Exaudi me sperantem in te; miserere mei pleni miseriis et peccatis, tu qui fontem miserationis numquam manare cessabis.\r\n\r\nSalve, salutaris victima, pro me et omnia humano genere in patibulo Crucis oblata. Salve, nobilis, et pretiose sanguis, de vulneribus crucifixi Domini mei Iesu Christi profluens, et peccata totius mundi abluens.\r\n\r\nRecordare, Domine, creaturae tuae, quam tuo Sanguine redemisti. Paenitet me peccasse, cupio emendare quod feci. Aufer ergo a me, clementissime Pater, omnes iniquitates et peccata mea; ut, purificatus mente et corpore, digne degustare merear Sancta sanctorum. Et concede, ut haec sancta praelibatio Corporis et Sanguinis tui, quam ego indignus sumere intendo, sit peccatorum meorum remissio, sit delictorum perfecta purgatio, sit turpium cogitationem effugatio ac bonorum sensuum regeneratio, operumque tibi placentium salubris efficacia, animae quoque et corporis contra inimicorum meorum insidias firmissima tuitio. Amen."}