{"language": "English", "category": "Holy Sacrifice of the Mass", "title": "In Preparation to Receive Communion", "text": "*Prayer of St. Thomas Aquinas*\r\nAlmighty and everlasting God, behold I come to the Sacrament of Thine only-begotten Son, our Lord Jesus Christ: I come as one infirm to the physician of life, as one unclean to the fountain of mercy, as one blind to the light of everlasting brightness, as one poor and needy to the Lord of heaven and earth.\r\nTherefore I implore the abundance of Thy measureless bounty that Thou wouldst vouchsafe to heal my infirmity, wash my uncleanness, enlighten my blindness, enrich my poverty and clothe my nakedness, that I may receive the Bread of Angels, the King of kings, the Lord of lords, with such reverence and humility, with such sorrow and devotion, with such purity and faith, with such purpose and intention as may be profitable to my soul’s salvation.\r\n\r\nGrant unto me, I pray, the grace of receiving not only the Sacrament of our Lord’s Body and Blood, but also the grace and power of the Sacrament. O most gracious God, grant me so to receive the Body of Thine only-begotten Son, our Lord Jesus Christ, which He took from the Virgin Mary, as to merit to be incorporated into His mystical Body, and to be numbered amongst His members. O most loving Father, give me grace to behold forever Thy beloved Son with His face at last unveiled, whom I now purpose to receive under the sacramental veil here below. Amen.\r\n\r\n*Prayer of St. Ambrose*\r\nLord Jesus Christ, I approach Thy banquet table in fear and trembling, for I am a sinner, and dare not rely on my own worth, but only on Thy goodness and mercy. I am defiled by my many sins in body and soul, and by my unguarded thoughts and words. Gracious God of majesty and awe, I seek Thy protection, I look for Thy healing. Poor troubled sinner that I am, I appeal to Thee, the fountain of all mercy. I cannot bear Thy judgment, but I trust in Thy salvation. Lord, I show my wounds to Thee and uncover my shame before Thee. I know my sins are many and great, and they fill me with fear, but I hope in Thy mercies, for they cannot be numbered.\r\n\r\nLord Jesus Christ, Eternal King, God and man, crucified for mankind, look upon me with mercy and hear my prayer, for I trust in Thee. Have mercy on me, full of sorrow and sin, for the depth of Thy compassion never ends.\r\nPraise to Thee saving sacrifice, offered on the wood of the Cross for me and for all mankind. Praise to the noble and Precious Blood, flowing from the wounds of my crucified Lord Jesus Christ and washing away the sins of the whole world.\r\n\r\nRemember, Lord, Thy creature, whom Thou hast redeemed with Thy Blood; I repent my sins, and I long to put right what I have done. Merciful Father, take away all my offences and sins; purify me in body and soul, and make me worthy to taste the Holy of Holies. May Thy Body and Blood, which I intend to receive, although I am unworthy, be for me the remission of my sins, the washing away of my guilt, the end of my evil thoughts, and the rebirth of my better instincts. May it incite me to do the works pleasing to Thee, and a firm defence of body and soul against the wiles of my enemies. Amen.\r\n\r\n*Prayer to the Blessed Virgin Mary*\r\nO most Blessed Virgin Mary, Mother of gentleness and mercy, I, a miserable and unworthy sinner, fly to thy protection with every sentiment of humility and love; and I implore of thy loving kindness that thou wouldst vouchsafe graciously to be near me, and all who throughout the whole Church are to receive the Body and Blood of thy Son this day, even as thou wert near thy sweetest Son as He hung bleeding on the Cross. Aided by thy gracious help, may we worthily approach this august Sacrament. Amen.\r\n\r\n*Prayer to St. Joseph*\r\nHappy and blessed art thou, O Joseph, to whom it was given not only to see and to hear that God Whom many kings desired to see, and saw not, to hear, and heard not; but also to bear Him in thine arms, to embrace Him, to clothe Him, and to guard and defend Him.\r\n\r\n℣. Pray for us, O blessed Joseph.\r\n℟. That we may be made worthy of the promises of Christ.\r\n\r\nLet us pray.\r\nO God, who hast given unto us a royal priesthood, vouchsafe, we beseech Thee, that as Blessed Joseph was found worthy to handle with his hands, and bear within his arms, Thine only-begotten Son, born of the Virgin Mary, so may we be made fit, by cleanness of heart and innocence of works, worthily to receive the most sacred Body and Blood of Thy Son, now in this present, and deserve to attain an everlasting reward in the world to come. Through the same Christ our Lord. Amen.\r\n\r\n*The Forming of One’s Intention*\r\nJoy with peace,\r\namendment of life,\r\nspace for true repentance,\r\nthe grace and comfort of the Holy Ghost,\r\nperseverance in good works,\r\na contrite and humble heart,\r\nand a happy consummation of my life,\r\ngrant unto me, O Almighty and merciful Lord. Amen.\r\n\r\n*Psalm 83*\r\nHow lovely are Thy tabernacles, O Lord of hosts!\r\nMy soul longeth and fainteth for the courts of the Lord. My heart and my flesh have rejoiced in the living God.\r\nFor the sparrow hath found herself a house, and the turtle a nest for herself where she may lay her young ones: Thy altars, O Lord of hosts, my king and my God.\r\nBlessed are they that dwell in thy house, O Lord: they shall praise Thee for ever and ever.\r\nBlessed is the man whose help is from Thee: in his heart he hath disposed to ascend by steps, in the vale of tears, in the place which he hath set.\r\nFor the lawgiver shall give a blessing, they shall go from virtue to virtue: the God of gods shall be seen in Sion.\r\nO Lord God of hosts, hear my prayer: give ear, O God of Jacob.\r\nBehold, O God our protector: and look on the face of Thy Christ.\r\nFor better is one day in thy courts above thousands. I have chosen to be an abject in the house of my God, rather than to dwell in the tabernacles of sinners.\r\nFor God loveth mercy and truth: the Lord will give grace and glory.\r\nHe will not deprive of good things them that walk in innocence: O Lord of hosts, blessed is the man that trusteth in Thee.\r\n\r\nGlory be to the Father,\r\nand to the Son,\r\nand to the Holy Ghost.\r\nAs it was in the beginning,\r\nis now, and ever shall be,\r\nworld without end.\r\nAmen."}