{"language": "English", "category": "Holy Sacrifice of the Mass", "title": "Leonine Prayers", "text": "Hail Mary, full of grace,\r\nthe Lord is with thee.\r\nBlessed art thou amongst women,\r\nand blessed is the fruit of thy womb, Jesus.\r\nHoly Mary, Mother of God,\r\npray for us sinners,\r\nnow and at the hour of our death.\r\nAmen.\r\n\r\nHail Mary, full of grace,\r\nthe Lord is with thee.\r\nBlessed art thou amongst women,\r\nand blessed is the fruit of thy womb, Jesus.\r\nHoly Mary, Mother of God,\r\npray for us sinners,\r\nnow and at the hour of our death.\r\nAmen.\r\n\r\nHail Mary, full of grace,\r\nthe Lord is with thee.\r\nBlessed art thou amongst women,\r\nand blessed is the fruit of thy womb, Jesus.\r\nHoly Mary, Mother of God,\r\npray for us sinners,\r\nnow and at the hour of our death.\r\nAmen.\r\n\r\nHail Holy Queen, Mother of mercy, our life, our sweetness, and our hope.\r\nTo thee do we cry, poor banished children of Eve.\r\nTo thee do we send up our sighs, mourning and weeping in this valley of tears.\r\n\r\nTurn then, most gracious Advocate, thine eyes of mercy toward us.\r\nAnd after this our exile show unto us the blessed fruit of thy womb, Jesus.\r\n\r\nO clement, O loving, O sweet Virgin Mary.\r\nAmen.\r\n\r\n℣. Pray for us, O holy Mother of God.\r\n℟. That we may be made worthy of the promises of Christ.\r\n\r\nLet us pray.\r\nO God, our refuge and our strength, look down with mercy upon the people who cry to Thee; and by the intercession of the glorious and immaculate Virgin Mary, Mother of God, of St. Joseph her spouse, of the blessed Apostles Peter and Paul, and of all the saints, in Thy mercy and goodness hear our prayers for the conversion of sinners, and for the liberty and exaltation of the Holy Mother the Church. Through the same Christ Our Lord.\r\nAmen.\r\n\r\nSaint Michael the Archangel, defend us in battle. Be our protection against the wickedness and snares of the devil; May God rebuke him, we humbly pray; And do thou, O Prince of the Heavenly Host, by the power of God, thrust into hell Satan and all evil spirits who wander through the world for the ruin of souls.\r\nAmen.\r\n\r\nMost Sacred Heart of Jesus. Have Mercy on Us.\r\nMost Sacred Heart of Jesus. Have Mercy on Us.\r\nMost Sacred Heart of Jesus. Have Mercy on Us."}