{"language": "English", "category": "Prayers by a Pontiff", "title": "Universal Prayer of Pope Clement XI", "text": "Lord, I believe in Thee: but let me believe more strongly. I hope in Thee: but let me hope more securely. I love Thee: but let me love Thee more ardently. I sorrow, but deepen my sorrow for my sins.\r\n\r\nI adore Thee as my first beginning, I long for Thee as my last end, I praise Thee as my constant benefactor, I call on Thee as my loving protector. Guide me by Thy wisdom, hold me with Thy justice, comfort me with Thy mercy, protect me with Thy power.\r\n\r\nI offer Thee, Lord, my thoughts, my words, my actions, and my sufferings to be fixed on Thee, to be according to Thee, and to be endured for Thee. I want to do what Thou willeth, in the way Thou willeth for as long as Thou willeth, because Thou willeth.\r\n\r\nI pray, O Lord, enlighten my understanding, inflame my will, purify my heart, and sanctify my soul. May I weep for my former iniquities, repel future temptations, correct my faults, and cultivate suitable virtues.\r\n\r\nGrant me, O God, love of Thee, hatred of me, zeal for my neighbor, contempt the world. May I be eager to obey my superiors, be courteous to my inferiors, faithful to my friends, and to forgive my enemies. Help me to conquer sensuality with austerity, greed with generosity, anger with gentleness, apathy with fervor.\r\n\r\nMake me prudent in planning, steadfast in danger, patient in adversity, and humble in prosperity. O Lord, make me attentive in prayer, temperate in drink, diligent in my duties, and firm in purpose. May I take care to have an innocent interior, a modest exterior, exemplary speech, and a well-ordered life.\r\n\r\nMay I be ever-watchfull in guarding against my weaknesses, cherishing Thy grace, keeping Thy laws, and coming to salvation. May I learn from Thee the passing nature of this world, the grandness of heaven, the shortness of this life, and the life to come eternal.\r\n\r\nGrant that I may prepare for death, fear judgment, flee from Hell, and obtain paradise. Grant this though Christ our Lord. Amen."}